export const map_data = {
  '0': {
    '0': {
      'masu': {
        'builds': [

        ]
      }
    }
  },
  '6': {
    'name': '中部海域6-',
    '5': {
      'C': {
        'builds': [
          {
            'name': 'パターン1',
            'formation': '輪形陣',
            'fleet1': [1618, 1543, 1591, 1591, 1575, 1575],
          },
          {
            'name': 'パターン2',
            'formation': '輪形陣',
            'fleet1': [1618, 1543, 1594, 1591, 1575, 1575],
          },
          {
            'name': 'パターン3',
            'formation': '輪形陣',
            'fleet1': [1618, 1543, 1594, 1594, 1575, 1575],
          },
          {
            'name': 'パターン4',
            'formation': '輪形陣',
            'fleet1': [1618, 1543, 1592, 1591, 1576, 1576],
          },
          {
            'name': 'パターン5',
            'formation': '輪形陣',
            'fleet1': [1618, 1543, 1595, 1591, 1576, 1576],
          },
          {
            'name': 'パターン6',
            'formation': '輪形陣',
            'fleet1': [1618, 1543, 1595, 1594, 1576, 1576],
          },
          {
            'name': 'パターン7(最終)',
            'formation': '輪形陣',
            'fleet1': [1618, 1543, 1592, 1592, 1577, 1577],
          },
          {
            'name': 'パターン8(最終)',
            'formation': '輪形陣',
            'fleet1': [1618, 1543, 1595, 1592, 1577, 1577],
          },
          {
            'name': 'パターン9(最終)',
            'formation': '輪形陣',
            'fleet1': [1618, 1543, 1595, 1595, 1577, 1577],
          },
        ]
      },
      'M': {
        'builds': [
          {
            'name': 'パターン1ボス(削り)',
            'formation': '第三警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1586, 1615, 1527, 1592, 1576, 1576],
            'fleet2': [1555, 1527, 1575, 1575, 1575, 1575],
          },
          {
            'name': 'パターン2ボス(削り)',
            'formation': '第三警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1586, 1615, 1615, 1592, 1577, 1577],
            'fleet2': [1555, 1527, 1527, 1577, 1575, 1575],
          },
          {
            'name': 'パターン3ボス(最終)',
            'formation': '第三警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1586, 1615, 1615, 1592, 1578, 1578],
            'fleet2': [1555, 1527, 1527, 1577, 1576, 1576],
          }
        ]
      }
    }
  },
  '41': {
    'name': '18冬',
    '2': {
      'Z': {
        'builds': [
          {
            'name': '甲ボス(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1780, 1762, 1762, 1529, 1577, 1577],
            'fleet2': [1555, 1592, 1577, 1577, 1577, 1577],
          },
          {
            'name': '甲ボス(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1780, 1762, 1762, 1567, 1623, 1623],
            'fleet2': [1555, 1592, 1623, 1623, 1623, 1623],
          },
          {
            'name': '乙ボス(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1778, 1523, 1523, 1529, 1576, 1576],
            'fleet2': [1554, 1591, 1576, 1501, 1501, 1501],

          },
          {
            'name': '乙ボス(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1778, 1762, 1762, 1529, 1576, 1576],
            'fleet2': [1554, 1591, 1576, 1576, 1501, 1501],
          }
        ]
      }
    },
    '3': {
      'U': {
        'builds': [
          {
            'name': '甲ボス(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1782, 1615, 1615, 1543, 1595, 1595],
            'fleet2': [1555, 1592, 1577, 1577, 1577, 1577],

          },
          {
            'name': '甲ボス(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1782, 1618, 1618, 1543, 1595, 1595],
            'fleet2': [1555, 1592, 1623, 1623, 1623, 1623],
          },
          {
            'name': '乙ボス(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1781, 1528, 1528, 1542, 1595, 1595],
            'fleet2': [1554, 1591, 1576, 1501, 1501, 1501],

          },
          {
            'name': '乙ボス(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1781, 1615, 1615, 1542, 1595, 1595],
            'fleet2': [1554, 1591, 1576, 1576, 1501, 1501],
          }
        ]
      }
    },
    '4': {
      'X': {
        'builds': [
          {
            'name': '甲ボス(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1785, 1780, 1558, 1558, 1529, 1529],
            'fleet2': [1595, 1595, 1740, 1740, 1740, 1740],

          },
          {
            'name': '甲ボス(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1788, 1780, 1558, 1558, 1567, 1567],
            'fleet2': [1595, 1595, 1743, 1743, 1743, 1743],
          },
          {
            'name': '乙ボス(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1784, 1558, 1558, 1558, 1529, 1529],
            'fleet2': [1594, 1594, 1576, 1576, 1501, 1501],
          },
          {
            'name': '乙ボス(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1787, 1780, 1558, 1558, 1529, 1529],
            'fleet2': [1594, 1594, 1739, 1739, 1739, 1739],
          },
          {
            'name': '丙ボス(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1783, 1526, 1526, 1526, 1524, 1524],
            'fleet2': [1594, 1575, 1575, 1501, 1501, 1501],
          },
          {
            'name': '丙ボス(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1786, 1526, 1526, 1526, 1529, 1529],
            'fleet2': [1594, 1575, 1575, 1501, 1501, 1501],
          },
          {
            'name': '丁ボス(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1783, 1513, 1513, 1513, 1524, 1524],
            'fleet2': [1575, 1575, 1501, 1501, 1501, 1501],
          },
          {
            'name': '丁ボス(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1786, 1526, 1526, 1526, 1524, 1524],
            'fleet2': [1594, 1575, 1575, 1501, 1501, 1501],
          }
        ]
      }
    },
    '5': {
      'L': {
        'builds': [
          {
            'name': '甲輸送ボス(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1643, 1763, 1577, 1577, 1639, 1639],
            'fleet2': [1740, 1577, 1577, 1577, 1501, 1501],
          },
          {
            'name': '甲輸送ボス(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1643, 1763, 1763, 1690, 1577, 1577],
            'fleet2': [1743, 1743, 1743, 1743, 1577, 1577],
          },
          {
            'name': '乙輸送ボス(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1642, 1762, 1576, 1576, 1637, 1637],
            'fleet2': [1577, 1576, 1576, 1576, 1501, 1501],
          },
          {
            'name': '乙輸送ボス(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1642, 1762, 1762, 1577, 1501, 1501],
            'fleet2': [1739, 1577, 1577, 1501, 1501, 1501],
          }
        ]
      },
      'T': {
        'builds': [
          {
            'name': '甲戦力ボス(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1661, 1762, 1762, 1594, 1594, 1591],
            'fleet2': [1743, 1743, 1577, 1577, 1577, 1577],
          },
          {
            'name': '甲戦力ボス(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1661, 1778, 1778, 1594, 1594, 1591],
            'fleet2': [1743, 1743, 1743, 1743, 1577, 1577],
          },
          {
            'name': '乙戦力ボス(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1660, 1762, 1594, 1591, 1577, 1577],
            'fleet2': [1577, 1577, 1501, 1501, 1501, 1501],
          },
          {
            'name': '乙戦力ボス(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1660, 1762, 1762, 1594, 1594, 1591],
            'fleet2': [1743, 1577, 1577, 1577, 1501, 1501],
          }
        ]
      }
    },
    '6': {
      'U': {
        'builds': [
          {
            'name': '甲戦力ボス1(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1626, 1778, 1778, 1592, 1577, 1577],
            'fleet2': [1743, 1743, 1577, 1577, 1577, 1577],
          },
          {
            'name': '甲戦力ボス1(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1626, 1778, 1778, 1542, 1592, 1592],
            'fleet2': [1743, 1743, 1743, 1743, 1577, 1577],
          },
          {
            'name': '乙戦力ボス1(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1625, 1777, 1777, 1591, 1577, 1577],
            'fleet2': [1577, 1577, 1501, 1501, 1501, 1501],
          },
          {
            'name': '乙戦力ボス1(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1625, 1777, 1777, 1541, 1591, 1591],
            'fleet2': [1742, 1742, 1577, 1577, 1501, 1501],
          }
        ]
      },
      'V': {
        'builds': [
          {
            'name': '甲戦力ボス2(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1792, 1595, 1595, 1592, 1740, 1740],
            'fleet2': [1743, 1743, 1739, 1739, 1739, 1739],
          },
          {
            'name': '甲戦力ボス2(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1792, 1780, 1595, 1595, 1592, 1592],
            'fleet2': [1743, 1743, 1743, 1743, 1743, 1743],
          },
          {
            'name': '乙戦力ボス2(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1791, 1527, 1527, 1591, 1577, 1577],
            'fleet2': [1740, 1740, 1577, 1577, 1501, 1501],
          },
          {
            'name': '乙戦力ボス2(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1791, 1527, 1527, 1592, 1577, 1577],
            'fleet2': [1743, 1743, 1577, 1577, 1577, 1577],
          }
        ]
      },
      'W': {
        'builds': [
          {
            'name': '甲戦力ボス3(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1600, 1557, 1778, 1592, 1577, 1577],
            'fleet2': [1555, 1743, 1743, 1577, 1577, 1577],
          },
          {
            'name': '甲戦力ボス3(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1600, 1557, 1557, 1778, 1778, 1592],
            'fleet2': [1555, 1743, 1743, 1743, 1577, 1577],
          },
          {
            'name': '乙戦力ボス3(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1600, 1542, 1778, 1591, 1577, 1577],
            'fleet2': [1555, 1577, 1577, 1577, 1501, 1501],
          },
          {
            'name': '乙戦力ボス3(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1600, 1557, 1778, 1592, 1557, 1557],
            'fleet2': [1555, 1743, 1577, 1577, 1501, 1501],
          }
        ]
      }
    },
    '7': {
      'Q': {
        'builds': [
          {
            'name': '甲パターン1',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1782, 1782, 1780, 1780, 1595, 1595],
            'fleet2': [1592, 1592, 1743, 1743, 1578, 1578],
          },
          {
            'name': '甲パターン2(最終？)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1782, 1782, 1780, 1780, 1543, 1543],
            'fleet2': [1592, 1592, 1743, 1743, 1743, 1743],
          },
          {
            'name': '乙パターン1',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1781, 1781, 1778, 1778, 1594, 1594],
            'fleet2': [1592, 1743, 1743, 1577, 1502, 1502],
          },
          {
            'name': '乙パターン2',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1781, 1781, 1777, 1542, 1577, 1577],
            'fleet2': [1591, 1742, 1742, 1577, 1502, 1502],
          },
          {
            'name': '乙パターン3(最終?)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1781, 1781, 1778, 1778, 1542, 1542],
            'fleet2': [1592, 1743, 1743, 1577, 1577, 1577],
          }
        ]
      },
      'V': {
        'builds': [
          {
            'name': '甲ボス1(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1795, 1543, 1543, 1595, 1595, 1780],
            'fleet2': [1592, 1592, 1743, 1743, 1743, 1743],
          },
          {
            'name': '甲ボス1(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1798, 1557, 1557, 1543, 1543, 1780],
            'fleet2': [1592, 1592, 1743, 1743, 1743, 1743],
          },
          {
            'name': '乙ボス1(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1794, 1542, 1542, 1595, 1595, 1778],
            'fleet2': [1592, 1743, 1743, 1577, 1577, 1577],
          },
          {
            'name': '乙ボス1(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1797, 1557, 1557, 1595, 1595, 1778],
            'fleet2': [1592, 1743, 1743, 1577, 1577, 1577],
          }
        ]
      },
      'X': {
        'builds': [
          {
            'name': '甲ボス2(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1801, 1780, 1780, 1780, 1790, 1595],
            'fleet2': [1555, 1592, 1592, 1744, 1744, 1744],
          },
          {
            'name': '甲ボス2(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1804, 1782, 1782, 1790, 1557, 1557],
            'fleet2': [1555, 1592, 1592, 1744, 1744, 1744],
          },
          {
            'name': '乙ボス2(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1800, 1780, 1778, 1778, 1595, 1595],
            'fleet2': [1555, 1592, 1592, 1743, 1743, 1743],
          },
          {
            'name': '乙ボス2(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1803, 1781, 1781, 1790, 1595, 1595],
            'fleet2': [1555, 1592, 1592, 1743, 1743, 1743],
          },
          {
            'name': '丙ボス2(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1799, 1778, 1778, 1778, 1594, 1594],
            'fleet2': [1555, 1591, 1591, 1742, 1742, 1742],
          },
          {
            'name': '丙ボス2(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1802, 1780, 1780, 1557, 1594, 1594],
            'fleet2': [1555, 1591, 1591, 1742, 1742, 1742],
          },
          {
            'name': '丁ボス2(削り)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1799, 1777, 1777, 1777, 1594, 1594],
            'fleet2': [1591, 1742, 1742, 1502, 1502, 1502],
          },
          {
            'name': '丁ボス2(最終)',
            'formation': '第四警戒航行序列',
            'isCombinedFleet': true,
            'fleet1': [1802, 1778, 1778, 1542, 1594, 1594],
            'fleet2': [1555, 1591, 1742, 1742, 1502, 1502],
          }
        ]
      }
    }
  }
};
